part1_4.html
<!doctype html>
<html lang="en">
<head>
<title>Baustein 1 Meeting 4</title>
<!-- 2019-05-17 Fri 20:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Baustein 1 Meeting 4</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lösungen zu den letzten Aufgaben</h2>
<div class="outline-text-2" id="text-1">
<p>
(Alle Lösungen sind nur Beispiele, es gibt viele Wege die zur Lösung führen)
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Funktionen</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">def</span> <span style="color: #0184bc;">combat</span>(health, damage):
    <span style="color: #8b4513;">difference</span> = health - damage
    <span style="color: #a626a4;">if</span> difference &lt; 0:
        <span style="color: #a626a4;">return</span> 0
    <span style="color: #a626a4;">else</span> <span style="color: #a626a4;">return</span> difference
<span style="color: #a626a4;">print</span>(combat(health=100, damage=20))
<span style="color: #a626a4;">print</span>(combat(health=10, damage=30))
</pre>
</div>

<p>
Oder einfacher:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">def</span> <span style="color: #0184bc;">combat</span>(health, damage):
    <span style="color: #a626a4;">return</span> <span style="color: #e44649;">max</span>(health - damage, 0)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">def</span> <span style="color: #0184bc;">abbrevName</span>(name):
    <span style="color: #8b4513;">parts</span> = name.split(<span style="color: #50a14f;">" "</span>)
    <span style="color: #a626a4;">return</span> parts[0][0].upper() + <span style="color: #50a14f;">"."</span> +  parts[1][0].upper()
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">def</span> <span style="color: #0184bc;">century</span>(year):
    <span style="color: #a626a4;">return</span> ((year-1) // 100) +1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Number guessing game</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">user_eingabe</span> = <span style="color: #008b8b;">None</span>
<span style="color: #8b4513;">geheime_zahl</span> = 42
<span style="color: #a626a4;">while</span> user_eingabe != geheime_zahl:
    <span style="color: #8b4513;">user_eingabe</span> = <span style="color: #e44649;">int</span>(<span style="color: #e44649;">input</span>(<span style="color: #50a14f;">"Bitte gebe eine Zahl ein: "</span>))
    <span style="color: #a626a4;">if</span> user_eingabe &gt; geheime_zahl:
        <span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Zu hoch gesch&#228;tzt!"</span>)
    <span style="color: #a626a4;">elif</span> user_eingabe &lt; geheime_zahl:
        <span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Zu niedrig gesch&#228;tzt!"</span>)
    <span style="color: #a626a4;">else</span>:
        <span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Richtig"</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mengen</h2>
<div class="outline-text-2" id="text-2">
<p>
Mengen sind ungeordnete Sammlungen von Objekten. Sie können kein Element mehrfach enthalten:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">my_numbers</span> = {1, 2, 3, 4, 5, 5, 6, 6}
<span style="color: #a626a4;">print</span>(my_numbers)
</pre>
</div>

<pre class="example">
{1, 2, 3, 4, 5, 6}

</pre>

<p>
Wie auch bei Listen und Dictionarys gibt es eine Built-in Funktion die bestimmte Objekte in Mengen umwandeln kann. Nochmal zur Übersicht:
</p>

<p>
<code>list(...)</code>
</p>

<p>
<code>dict(...)</code>
</p>

<p>
<code>set(...)</code>
</p>

<p>
Erzeugen Listen, Wörterbücher und Mengen aus ihren Argumenten (wenn möglich).
</p>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">letter_set</span> = <span style="color: #e44649;">set</span>(<span style="color: #50a14f;">"A Python Tutorial"</span>)
<span style="color: #a626a4;">print</span>(letter_set)
<span style="color: #8b4513;">meine_liste</span> = [<span style="color: #50a14f;">"A"</span>,<span style="color: #50a14f;">"B"</span>,<span style="color: #50a14f;">"C"</span>,<span style="color: #50a14f;">"A"</span>,<span style="color: #50a14f;">"B"</span>,<span style="color: #50a14f;">"C"</span>]

<span style="color: #8b4513;">leeres_w&#246;rterbuch</span> = <span style="color: #e44649;">dict</span>()

<span style="color: #8b4513;">liste_ohne_duplikate</span> = <span style="color: #e44649;">list</span>(<span style="color: #e44649;">set</span>(meine_liste))
</pre>
</div>

<pre class="example">
{'T', 'A', 'i', 'h', 'y', 'P', ' ', 'r', 'l', 'o', 'a', 't', 'n', 'u'}

</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Objektorientierte Programmierung</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Klassen und Objekte</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Zusammenhänge in der echten Welt sind sehr komplex. Computer hingegen sind eigentlich ziemlich doof: Sie können nur mit exakten Rechenregeln arbeiten und stumpf Befehle ausführen. Um die Welt "berechenbar" zu machen braucht man also immer ein Modell: Ein vereinfachtes Abbild der Wirklichkeit.
</p>

<p>
Objektorientierung ist eine Möglichkeit, Zusammenhänge zu modellieren. Die Grundidee ist, jede Sache in der echten Welt als Objekt mit einem Zustand und fest definiertem Verhalten darzustellen.
</p>

<p>
Klassen sind Baupläne für Objekte. Sie beschreiben, welche Funktionalität ein konkretes Objekt hat, und welche Zustände es besitzt. Objekte sind dann konkrete Instanzen von Klassen.
</p>

<p>
<i>Genauere Erklärung und Diskussion über OOP im Kurs</i>
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">class</span> <span style="color: #c18401;">Dog</span>:

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">__init__</span>(<span style="color: #a626a4;">self</span>, name, age):
        <span style="color: #a626a4;">self</span>.age = age
        <span style="color: #a626a4;">self</span>.name = name

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">sit</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #a626a4;">self</span>.name + <span style="color: #50a14f;">" is now sitting."</span>)

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">roll_over</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #a626a4;">self</span>.name + <span style="color: #50a14f;">" rolled over!"</span>)

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">print_age</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #a626a4;">self</span>.name + <span style="color: #50a14f;">" is "</span> + <span style="color: #e44649;">str</span>(<span style="color: #a626a4;">self</span>.age) + <span style="color: #50a14f;">" years old."</span>)


<span style="color: #8b4513;">cooper</span> = Dog(<span style="color: #50a14f;">"cooper"</span>, 5)
cooper.roll_over()
cooper.sit()
cooper.print_age()
</pre>
</div>

<pre class="example">
cooper rolled over!
cooper is now sitting.
cooper is 5 years old.

</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Vererbung</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Einige Klassen haben Gemeinsamkeiten und Unterschiede
</li>
<li>Die Gemeinsamkeiten wollen wir nicht doppelt in Code ausdrücken
</li>
<li>Deshalb erstellen wir eine “Elternklasse” mit den Gemeinsamkeiten und “erben” davon.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">class</span> <span style="color: #c18401;">Animal</span>:

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">__init__</span>(<span style="color: #a626a4;">self</span>, name, age):
        <span style="color: #a626a4;">self</span>.name = name
        <span style="color: #a626a4;">self</span>.age = age

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">eat</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #a626a4;">self</span>.name + <span style="color: #50a14f;">" isst etwas."</span>)

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">move</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #a626a4;">self</span>.name + <span style="color: #50a14f;">" bewegt sich."</span>)

<span style="color: #a626a4;">class</span> <span style="color: #c18401;">Bird</span>(Animal):

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">fly</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Ich kann flieeeegen - "</span> + <span style="color: #a626a4;">self</span>.name + <span style="color: #50a14f;">"."</span>)

<span style="color: #a626a4;">class</span> <span style="color: #c18401;">Dog</span>(Animal):

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">bark</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Woof Woof"</span>)


<span style="color: #a626a4;">class</span> <span style="color: #c18401;">Mops</span>(Dog):

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">bark</span>(<span style="color: #a626a4;">self</span>):
        <span style="color: #e44649;">super</span>().bark()
        <span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"fiep"</span>)

<span style="color: #a626a4;">class</span> <span style="color: #c18401;">Parrot</span>(Bird, Dog):

    <span style="color: #a626a4;">def</span> <span style="color: #0184bc;">__init__</span>(<span style="color: #a626a4;">self</span>, name, age, color):
        <span style="color: #e44649;">super</span>().__init__(name, age)
        <span style="color: #a626a4;">self</span>.color = color


<span style="color: #8b4513;">loewe</span> = Animal(<span style="color: #50a14f;">"L&#246;we"</span>, 5)
loewe.eat()
loewe.move()
<span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"-------------"</span>)
<span style="color: #8b4513;">doggie</span> = Dog(<span style="color: #50a14f;">"Doggie"</span>, 7)
doggie.bark()
doggie.eat()
<span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"-------------"</span>)
<span style="color: #8b4513;">ruffi</span> = Mops(<span style="color: #50a14f;">"Ruffi"</span>, 3)
ruffi.eat()
ruffi.bark()
</pre>
</div>

<pre class="example">
Löwe isst etwas.
Löwe bewegt sich.
-------------
Woof Woof
Doggie isst etwas.
-------------
Ruffi isst etwas.
Woof Woof
fiep

</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Übung: Objektorientiertes Bankkonto</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Implementiert die Klasse <code>Bankkonto</code>.
</p>

<ul class="org-ul">
<li>Ein Bankkonto hat eine eindeutige ID und einen Kontostand (anfänglich 0)
</li>
<li>Man kann einen bestimmten Betrag einzahlen und auszahlen
</li>
<li>Man kann sich den aktuellen Kontostand ausgeben lassen
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Übung (fortgeschritten): Piraterie</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<a href="https://www.codewars.com/kata/object-oriented-piracy">https://www.codewars.com/kata/object-oriented-piracy</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Weiterführend: Python lernen</h2>
<div class="outline-text-2" id="text-4">
<p>
Der erste Teil des Kurses ist vorbei und ihr möchtet alleine weitermachen? Kein Problem, es gibt mehrere Möglichkeiten zu üben.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Coding - Katas</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Unter Entwicklern hat sich eine bestimmte Trainingsmethode etabliert: Die sogenannten Katas (der Begriff kommt aus dem Kampfsport). Hierbei schreibt ein Entwickler ein Problem auf, dass es zu lösen gilt. Zusätzlich schreibt der Herausforderer Test-Code der Überprüft, ob das Problem richtig gelöst wurde. Der andere Entwickler muss dann versuchen, das Problem so zu lösen dass der Test erfolgreich verläuft.
</p>

<p>
Es gibt eine Website, auf der man diese Katas in allen Schwierigkeitsgraden lösen kann: <a href="https://www.codewars.com">https://www.codewars.com</a>. Meldet euch gerne dort an (wenn ihr wollt, tretet dem Clan "moinworld" bei 😉). Eine unterhaltsame Möglichkeit zum Üben :)
</p>

<p>
Viele Aufgaben aus diesem Kurs sind von codewars. Hier die komplette Liste, falls ihr dafür die Punkte holen wollt:
</p>

<p>
<a href="https://www.codewars.com/kata/drink-about/python">https://www.codewars.com/kata/drink-about/python</a>
</p>

<p>
<a href="https://www.codewars.com/kata/thinkful-logic-drills-traffic-light">https://www.codewars.com/kata/thinkful-logic-drills-traffic-light</a>
</p>

<p>
<a href="https://www.codewars.com/kata/sum-of-multiples">https://www.codewars.com/kata/sum-of-multiples</a>
</p>

<p>
<a href="http://www.codewars.com/kata/century-from-year/train/python">http://www.codewars.com/kata/century-from-year/train/python</a>
</p>

<p>
<a href="http://www.codewars.com/kata/grasshopper-terminal-game-combat-function-1/train/python">http://www.codewars.com/kata/grasshopper-terminal-game-combat-function-1/train/python</a>
</p>

<p>
<a href="http://www.codewars.com/kata/abbreviate-a-two-word-name/train/python">http://www.codewars.com/kata/abbreviate-a-two-word-name/train/python</a>
</p>

<p>
Für unser Erfahrungslevel sind Kata der Schwierigkeitsstufe 8 und 7 (sprache Python!) geeignet.
</p>

<p>
<a href="http://www.codewars.com/kata/search/python?q=&amp;r%5B%5D=-8&amp;r%5B%5D=-7&amp;beta=false">http://www.codewars.com/kata/search/python?q=&amp;r%5B%5D=-8&amp;r%5B%5D=-7&amp;beta=false</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Online - Kurse</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Generell eine gute Resource um selbst zu lernen ist der Kurs von codecadamy: <a href="https://www.codecademy.com/learn/learn-python">https://www.codecademy.com/learn/learn-python</a> Dort gibt es interaktive Erklärungen zum Stoff und auch Übungsaufgaben die ganz genau erklärt und mit Hinweisen bestückt sind. Aber vorsicht: Dieser Kurs lehrt die Python Version zwei. Ist aber wie bereits erwähnt nicht schlimm, da der Unterschied zwischen Python 2 und 3 nicht groß ist. Es gibt auch einen Kurs für Python3, Kostet aber ziemlich viel (Mitgliedschaft für ~ 20€ /Monat), immerhin gibt es eine kostenlose 7 Tage mitgliedschaft.
</p>

<p>
Darüber hinaus gibt es noch unzählige Kurse, sogar mobile Apps zum Lernen. Die habe ich natürlich nicht alle ausprobiert, aber generell sind solche Kurse zumindest vom Inhalt in guter Qualität. Das beste ist, etwas zu suchen was einem Spass macht und voran bringt.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Eigene Projekte</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Für die Motivation super: Ein eigenes Projekt ausdenken (nicht zu schwierig!) und einfach kraft Suchmaschine und Entwicklerforen wie stackoverflow.com / moinworld slack umsetzen.
</p>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Lösungen zu den letzten Aufgaben</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Funktionen</a></li>
<li><a href="#sec-1-2">1.2. Number guessing game</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Mengen</a></li>
<li><a href="#sec-3">3. Objektorientierte Programmierung</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Klassen und Objekte</a></li>
<li><a href="#sec-3-2">3.2. Vererbung</a></li>
<li><a href="#sec-3-3">3.3. Übung: Objektorientiertes Bankkonto</a></li>
<li><a href="#sec-3-4">3.4. Übung (fortgeschritten): Piraterie</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Weiterführend: Python lernen</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Coding - Katas</a></li>
<li><a href="#sec-4-2">4.2. Online - Kurse</a></li>
<li><a href="#sec-4-3">4.3. Eigene Projekte</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Falco Winkler</p>
<p class="date">Created: 2019-05-17 Fri 20:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.9)</p>
</div>
</footer>
</body>
</html>
